app/views/poosts/_poost.html.erb


  <% poost.comeents.each do |comeent| %>
---
SELECT "comeents".* FROM "comeents" WHERE "comeents"."poost_id" = $1  [["poost_id", 1]]