app/views/poosts/index.html.erb

                                <%= link_to "VER POST", poost, class:"link" %>
                                  <% Poost::Kinds.each do |kind| %>
---
SELECT "poosts".* FROM "poosts"

                                              <i class="fa-regular fa-thumbs-up"></i>
                                              <%= Reaction.where(kind: kind,poost_id: poost.id).count %>
---
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."kind" = $1 AND "reactions"."poost_id" = $2  [["kind", "like"], ["poost_id", 1]]

                                            <i class="fa-regular fa-thumbs-down"></i>
                                              <%= Reaction.where(kind: kind,poost_id: poost.id).count %>
---
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."kind" = $1 AND "reactions"."poost_id" = $2  [["kind", "dislike"], ["poost_id", 1]]