app/views/poosts/show.html.erb

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."kind" = $1 AND "reactions"."poost_id" = $2  [["kind", "like"], ["poost_id", 1]]
---
      <i class="fa-regular fa-thumbs-up"></i>
      <%= Reaction.where(kind: kind,poost_id: @poost.id).count %>

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."kind" = $1 AND "reactions"."poost_id" = $2  [["kind", "dislike"], ["poost_id", 2]]
---
     <i class="fa-regular fa-thumbs-down"></i>
      <%= Reaction.where(kind: kind,poost_id: @poost.id).count %>

SELECT "comeents".* FROM "comeents" WHERE "comeents"."poost_id" = $1  [["poost_id", 1]]
---

<% @poost.comeents.each do |comeent| %>