app/controllers/comeents_controller.rb

SELECT "poosts".* FROM "poosts" WHERE "poosts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comeents" ("content", "usser_id", "poost_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "demo 1"], ["usser_id", 1], ["poost_id", 2], ["created_at", "2023-08-04 19:03:19.908438"], ["updated_at", "2023-08-04 19:03:19.908438"]]
---
  def create
    @poost = Poost.find(params[:comeent][:poost_id])
    @comeent = Comeent.new(comeent_params)
    @comeent.usser = current_usser # se define el usuario del comentario

    respond_to do |format|
      if @comeent.save