app/controllers/poosts_controller.rb

  def index
    @poosts = Poost.all
---
SELECT "poosts".* FROM "poosts"

  def show
    @poost = Poost.find(params[:id])
---
SELECT "poosts".* FROM "poosts" WHERE "poosts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @poost = Poost.new(poost_params)

    respond_to do |format|
      if @poost.save
---
INSERT INTO "poosts" ("title", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Title 1"], ["description", "Description 1"], ["image", nil], ["created_at", "2023-08-02 00:51:25.052965"], ["updated_at", "2023-08-02 00:51:25.052965"]]

  def update
    respond_to do |format|
      if @poost.update(poost_params)
---
UPDATE "poosts" SET "updated_at" = $1 WHERE "poosts"."id" = $2  [["updated_at", "2023-08-02 00:51:25.069714"], ["id", 1]]

    def set_poost
      @poost = Poost.find(params[:id])
---
SELECT "poosts".* FROM "poosts" WHERE "poosts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]