app/controllers/reactions_controller.rb

SELECT "poosts".* FROM "poosts" WHERE "poosts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."usser_id" = $1 AND "reactions"."poost_id" = $2 LIMIT $3  [["usser_id", 1], ["poost_id", 1], ["LIMIT", 1]]
INSERT INTO "ussers" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "created_at", "updated_at", "name", "nickname") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "reactions" ("kind", "reaction_type", "comeent_id", "usser_id", "poost_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["kind", "like"], ["reaction_type", "post"], ["comeent_id", nil], ["usser_id", 1], ["poost_id", 2], ["created_at", "2023-08-04 18:39:32.333650"], ["updated_at", "2023-08-04 18:39:32.333650"]]
---
  def user_reaction

    @usser = current_usser
    @type = params[:reaction_type]
    @poost = Poost.find(params[:poost_id]) if params[:poost_id]
    @kind = params[:kind]

    respond_to do |format|

      reactions = Reaction.find_by(usser_id: @usser.id, poost_id: @poost.id)

      if reactions
        format.html { redirect_to poost_path(@poost), notice: 'No puedes dar mas like a este Gatito' }
      else

            @reaction = Reaction.new(usser_id: @usser.id, poost_id: @poost.id, reaction_type: @type, kind: @kind)

            if @reaction.save